trade_exp/src/Documents/НачислениеУдержаний/НачислениеУдержаний.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="5d8a03cd-d5c8-46f5-ab14-2d869dcf74d4">
  <name>НачислениеУдержаний</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="16445800-7967-449f-8c66-23c16a28c879">
    <name>ПериодНачисления</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="6d6100e2-9f67-45ae-a549-786006e4950f">
    <name>Автор</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="e982ee89-17c2-4250-aa5e-cfb6c417006d">
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <tabularSections extendedConfigurationObject="81364a2d-6fde-4a09-951a-52338aa0b523">
    <name>Начисления</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="d459c4c0-3fe2-4351-b78a-ae457b79e35d">
      <name>Сотрудник</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="7397e03f-aef7-423c-86cc-3f0a146a6bae">
      <name>Удержание</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="e816dce6-75e3-493d-9996-c99d809ef457">
      <name>СуммаЗадержки</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>10</precision>
            <scale>2</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="10358a37-0ede-4894-a3ef-241cc82251d1">
      <name>СуммаУдержания</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>10</precision>
            <scale>2</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="60dd34e3-5436-4697-a77f-64a2952a97ee">
      <name>СуммаВозврата</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>10</precision>
            <scale>2</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="ec73c35f-b1e7-4dc5-8812-ee153d6cd933">
      <name>РегистраторУдержания</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
</mdclass:Document>

trade_exp/src/AccumulationRegisters/НачисленияУдержаний/НачисленияУдержаний.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="cb276f85-23f2-4f34-b5ad-8ff4958f4b48">
  <name>НачисленияУдержаний</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <registerType>Checked</registerType>
  </extension>
  <registerType>Turnovers</registerType>
  <resources extendedConfigurationObject="a8a6f686-64bf-486f-878a-3a2d11d1ea5a">
    <name>СуммаЗадержки</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="7fcb5e70-0a78-4965-ac0e-da25b7f35f36">
    <name>СуммаУдержания</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="9eb43b5e-6086-4599-a2ee-f1b93f27250d">
    <name>СуммаВозврата</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="fc07c14a-9677-45ed-a7f3-c48d32cfeeee">
    <name>СуммаСторно</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <dimensions extendedConfigurationObject="92b35696-bc4b-4e39-baf2-792c4df395c3">
    <name>ПериодНачисления</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </dimensions>
  <dimensions extendedConfigurationObject="1a2b70d4-deac-4462-b1b6-dd336507cf52">
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="2be42aa7-4d0f-4215-8085-021885108398">
    <name>Сотрудник</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="7bfc9cfa-618d-41a7-a85f-18574af79ef9">
    <name>Удержание</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="6e85eda3-b516-437b-96b7-6bdaadc191cf">
    <name>РегистраторУдержания</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:AccumulationRegister>

trade_exp/src/InformationRegisters/Удержания/Удержания.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="2d53e5c9-911b-4810-b8d1-7e5cf4d442c8">
  <name>Удержания</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <writeMode>RecorderSubordinate</writeMode>
  <resources extendedConfigurationObject="6cbacd10-1223-48c2-8695-eb624272b705">
    <name>СуммаУдержания</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <dimensions extendedConfigurationObject="d41a7967-81fb-464b-87dc-fad4c0eb575f">
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="441ad33d-ec2b-442a-b6f1-d2f8f9571a10">
    <name>Сотрудник</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="a571e0c2-1cdc-4e8c-b3f4-d6f22838e55c">
    <name>Удержание</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="063b3a13-df87-44be-976e-25da34f40d6e">
    <name>ДатаНачалаДействия</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="c5dca119-88ef-4e61-b6e5-3917fe28b599">
    <name>ДатаОкончанияДействия</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="4bc62299-cfbd-4b49-b31c-5a1e0e83824d">
    <name>Периодический</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="e2b90059-59db-43b4-8a12-ae8522d97ffd">
    <name>Закрыт</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="4246bf06-45ee-4f7b-9f7d-37cc4e74a99b">
    <name>Проблема</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

trade_exp/src/Documents/НачислениеУдержаний/Forms/ФормаДокумента/Module.bsl
&НаКлиенте
Процедура ЗаполнитьТекущимиУдержаниями(Команда)
	Если Объект.Проведен Тогда
		Предупреждение("перед перезаполнением необходимо распровести документ!", 5);
		Возврат;
	КонецЕсли;
	
	Если Объект.Начисления.Количество() > 0 Тогда
		ОтветНаВопрос = Вопрос(НСтр("ru='Таблица ""Начисления"" будет перезаполнена. Продолжить?'"), РежимДиалогаВопрос.ДаНет);
		Если ОтветНаВопрос = КодВозвратаДиалога.Нет Тогда
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	ЗаполнитьТекущимиУдержаниямиНаСервере();
	ЭтаФорма.Модифицированность= Истина;
КонецПроцедуры
//Сам расчет
&НаСервере
Процедура ЗаполнитьТекущимиУдержаниямиНаСервере()//Расчет
	ПериодНачисления= КонецМесяца(Объект.ПериодНачисления);
	Объект.Начисления.Очистить();
	
	ТЗНачисления= Объект.Начисления.Выгрузить();
	//////////////////////////// Штрафы /////////////////////////////
	//Разовый штраф
	ВыборкаУдержания = ЗапросПоРазовымУдержаниям();
	Пока ВыборкаУдержания.Следующий() Цикл
		НоваяСтрока= Объект.Начисления.Добавить();
		НоваяСтрока.Сотрудник= ВыборкаУдержания.Сотрудник;
		НоваяСтрока.Удержание= ВыборкаУдержания.Удержание;
		НоваяСтрока.СуммаУдержания= ВыборкаУдержания.СуммаУдержания;
		НоваяСтрока.РегистраторУдержания= ВыборкаУдержания.Регистратор;
	КонецЦикла;		
	
	//////////////////////////////Периодические штраф////////////////////////////
	ВыборкаУдержания = ЗапросПоПериодическимУдержаниям();
	Пока ВыборкаУдержания.Следующий() Цикл
		Пропустить= Ложь;
		НоваяСтрока= Неопределено;
		ТЗУдержаний= ПолучитьСуммыУдержаний(ВыборкаУдержания);
		
		ДатаОкончанияДействия= ?(ЗначениеЗаполнено(ВыборкаУдержания.ДатаОкончанияДействия), ВыборкаУдержания.ДатаОкончанияДействия, КонецМесяца(Объект.ПериодНачисления));
		ДатаРасчета= ?(ДатаОкончанияДействия>КонецМесяца(Объект.ПериодНачисления), КонецМесяца(Объект.ПериодНачисления), ДатаОкончанияДействия);
		
		РазностьДат= ОбщегоНазначенияУТ.РазностьДат(ВыборкаУдержания.ДатаНачалаДействия, ДатаРасчета, Перечисления.Периодичность.День);
		
		//Закрытые в этом месяце не штрафуем
		Если ВыборкаУдержания.Закрыт = Ложь ИЛИ (ВыборкаУдержания.Закрыт И КонецМесяца(ВыборкаУдержания.ДатаОкончанияДействия) > КонецМесяца(Объект.ПериодНачисления)) Тогда	
			//До начала начисления должно пройти несколько месяцев
			Если РазностьДат >= ВыборкаУдержания.Удержание.КоличествоДнейПередНачаломНачисления Тогда
				НоваяСтрока= Объект.Начисления.Добавить();
				НоваяСтрока.Сотрудник= ВыборкаУдержания.Сотрудник;
				НоваяСтрока.Удержание= ВыборкаУдержания.Удержание;
				НоваяСтрока.РегистраторУдержания= ВыборкаУдержания.Регистратор;
				
				Если ТЗУдержаний.Количество() <> 0 Тогда//последующие разы, уже были удержания 
					НоваяСтрока.СуммаЗадержки= ВыборкаУдержания.Тариф/2;
					НоваяСтрока.СуммаУдержания= ВыборкаУдержания.Тариф/2;
					//Вслучае солидарной ответственности с МАП делим ещё на 2
					Если ТипЗнч(НоваяСтрока.РегистраторУдержания) = Тип("ДокументСсылка.ЛистСогласования") И ЗначениеЗаполнено(НоваяСтрока.РегистраторУдержания.МАП) Тогда
						НоваяСтрока.СуммаЗадержки= НоваяСтрока.СуммаЗадержки/2;
						НоваяСтрока.СуммаУдержания= НоваяСтрока.СуммаУдержания/2;
					КонецЕсли;
				Иначе//Первый раз еще небыло удержаний
					НоваяСтрока.СуммаЗадержки= ВыборкаУдержания.СуммаУдержания;
				КонецЕсли;
				
			КонецЕсли;
		КонецЕсли;
		
		/////////////////////////////////////// Возвраты //////////////////////////////////////////
		Если ВыборкаУдержания.Закрыт И НачалоМесяца(ВыборкаУдержания.ДатаОкончанияДействия) = НачалоМесяца(Объект.ПериодНачисления) Тогда 
						
			//Если ТЗУдержаний.Количество() > 0 Тогда 
			//	ПерваяСумма= ТЗУдержаний[0].СуммаЗадержки;
			//Иначе
			//	ПерваяСумма= 0;
			//КонецЕсли;
			//ПослудующиеСуммы= ТЗУдержаний.Итог("СуммаУдержания")-ПерваяСумма;
			//Формула
			//СуммаВозврата= ПерваяСумма+(ПослудующиеСуммы/2);
			//СуммаВозврата= ПерваяСумма;
			СуммаВозврата= ТЗУдержаний.Итог("СуммаЗадержки");
			Если  СуммаВозврата > 0 Тогда
				НоваяСтрока= Объект.Начисления.Добавить();
				НоваяСтрока.Сотрудник= ВыборкаУдержания.Сотрудник;
				НоваяСтрока.Удержание= ВыборкаУдержания.Удержание;
				НоваяСтрока.РегистраторУдержания= ВыборкаУдержания.Регистратор;
				НоваяСтрока.СуммаВозврата= СуммаВозврата;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьСуммыУдержаний(НоваяСтрока)
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	НАЧАЛОПЕРИОДА(НачисленияУдержанийОбороты.ПериодНачисления, МЕСЯЦ) КАК ПериодНачисления,
	|	НачисленияУдержанийОбороты.Сотрудник,
	|	НачисленияУдержанийОбороты.Удержание,
	|	НачисленияУдержанийОбороты.РегистраторУдержания,
	|	СУММА(НачисленияУдержанийОбороты.СуммаВозвратаОборот) КАК СуммаВозврата,
	|	СУММА(НачисленияУдержанийОбороты.СуммаЗадержкиОборот) КАК СуммаЗадержки,
	|	СУММА(НачисленияУдержанийОбороты.СуммаУдержанияОборот) КАК СуммаУдержания
	|ИЗ
	|	РегистрНакопления.НачисленияУдержаний.Обороты(, , , ) КАК НачисленияУдержанийОбороты
	|ГДЕ
	|	НачисленияУдержанийОбороты.Сотрудник = &Сотрудник
	|	И НачисленияУдержанийОбороты.Удержание = &Удержание
	|	И НачисленияУдержанийОбороты.РегистраторУдержания = &РегистраторУдержания
	|	И НачисленияУдержанийОбороты.ПериодНачисления < &ПериодНачисления
	|
	|СГРУППИРОВАТЬ ПО
	|	НачисленияУдержанийОбороты.Сотрудник,
	|	НАЧАЛОПЕРИОДА(НачисленияУдержанийОбороты.ПериодНачисления, МЕСЯЦ),
	|	НачисленияУдержанийОбороты.РегистраторУдержания,
	|	НачисленияУдержанийОбороты.Удержание
	|
	|УПОРЯДОЧИТЬ ПО
	|	ПериодНачисления";
	
	Запрос.УстановитьПараметр("Сотрудник", НоваяСтрока.Сотрудник);
	Запрос.УстановитьПараметр("Удержание", НоваяСтрока.Удержание);
	Запрос.УстановитьПараметр("РегистраторУдержания", НоваяСтрока.Регистратор);
	Запрос.УстановитьПараметр("ПериодНачисления", КонецМесяца(Объект.ПериодНачисления)-1);
	
	РезультатЗапроса = Запрос.Выполнить();
	ТЗ= РезультатЗапроса.Выгрузить();
	
	Возврат ТЗ;
КонецФункции

//Запросы
&НаСервере
Функция ЗапросПоРазовымУдержаниям()
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Удержания.Сотрудник,
	|	Удержания.Удержание,
	|	Удержания.ДатаНачалаДействия,
	|	Удержания.ДатаОкончанияДействия,
	|	Удержания.Периодический,
	|	Удержания.Закрыт,
	|	Удержания.СуммаУдержания,
	|	Удержания.Регистратор,
	|	Удержания.Удержание.Тариф КАК Тариф
	|ИЗ
	|	РегистрСведений.Удержания КАК Удержания
	|ГДЕ
	|	Удержания.СуммаУдержания > 0
	|	И НАЧАЛОПЕРИОДА(Удержания.ДатаНачалаДействия, МЕСЯЦ) = &ПериодНачисления
	|	И Удержания.Периодический = ЛОЖЬ
	|
	|УПОРЯДОЧИТЬ ПО
	|	Удержания.Сотрудник.Наименование";
	
	Запрос.УстановитьПараметр("ПериодНачисления", НачалоМесяца(Объект.ПериодНачисления));
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаУдержания = РезультатЗапроса.Выбрать();
	
	Возврат ВыборкаУдержания;
КонецФункции
&НаСервере
Функция ЗапросПоПериодическимУдержаниям()
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Удержания.Сотрудник,
	|	Удержания.Удержание,
	|	Удержания.ДатаНачалаДействия,
	|	Удержания.ДатаОкончанияДействия,
	|	Удержания.Периодический,
	|	Удержания.Закрыт,
	|	Удержания.СуммаУдержания,
	|	Удержания.Регистратор,
	|	Удержания.Удержание.Тариф КАК Тариф
	|ИЗ
	|	РегистрСведений.Удержания КАК Удержания
	|ГДЕ
	|	Удержания.СуммаУдержания > 0
	|	И Удержания.Периодический = ИСТИНА
	|	И Удержания.ДатаНачалаДействия <= &КонецПериодаНачисления
	|	И Удержания.Сотрудник.Недействителен = ЛОЖЬ
	|
	|УПОРЯДОЧИТЬ ПО
	|	Удержания.Сотрудник.Наименование";
	
	Запрос.УстановитьПараметр("НачалоПериодаНачисления", НачалоМесяца(Объект.ПериодНачисления));
	Запрос.УстановитьПараметр("КонецПериодаНачисления", КонецМесяца(Объект.ПериодНачисления));
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаУдержания = РезультатЗапроса.Выбрать();
	
	Возврат ВыборкаУдержания;
КонецФункции

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Не ЗначениеЗаполнено(Объект.Автор) Тогда 
		Объект.Автор= Пользователи.ТекущийПользователь();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПериодНачисленияПриИзменении(Элемент)
	Объект.ПериодНачисления= НачалоМесяца(Объект.ПериодНачисления);
КонецПроцедуры
